eclipse-threadx/guix/src/display_driver/stm324x9i_eval/gx_display_driver_stm324x9i_565rgb_rotated.c
/**************************************************************************/
/*                                                                        */
/*       Copyright (c) Microsoft Corporation. All rights reserved.        */
/*                                                                        */
/*       This software is licensed under the Microsoft Software License   */
/*       Terms for Microsoft Azure RTOS. Full text of the license can be  */
/*       found in the LICENSE file at https://aka.ms/AzureRTOS_EULA       */
/*       and in the root directory of this software.                      */
/*                                                                        */
/**************************************************************************/


/**************************************************************************/
/**************************************************************************/
/**                                                                       */
/** GUIX Component                                                        */
/**                                                                       */
/**   STM324XG Screen Driver                                              */
/**                                                                       */
/**************************************************************************/


#include   "tx_api.h"
#include   "gx_api.h"
#include   "gx_system.h"
#include   "gx_display.h"
#include   "gx_utility.h"
#include   "gx_display_driver_stm324x9i.h"
#include   "stm324x9i_eval_lcd.h"

#define SDRAM _Pragma("location=\"SD_RAM\"")

SDRAM USHORT frame_buffer[STM32F429_DISCO_SCREEN_WIDTH][STM32F429_DISCO_SCREEN_HEIGHT];

static DMA2D_HandleTypeDef Dma2dHandle;
static UINT                (*dma_wait_function)(void *) = GX_NULL;
static VOID               *wait_func_param;
static USHORT             *visible_frame_buffer = (USHORT *)frame_buffer;
#ifdef GX_PING_PONG_FRAME_BUFFERS
static TX_SEMAPHORE        register_reload_semaphore;
static GX_BOOL             frame_buffer_toggle_start = GX_FALSE;
#endif

/**************************************************************************/
/*  gx_display_wait_function_set                                          */
/*    Default function override, provide a service to call back into      */
/*    the application while waiting for DMA2D operation to complete       */
/**************************************************************************/
VOID gx_display_wait_function_set_565rgb(UINT (*wait_func)(void *), void *param)
{
    dma_wait_function = wait_func;
    wait_func_param = param;
}

/**************************************************************************/
/*  DefaultDmaInitStruct                                                  */
/*    Configure DMA2D default structure values                            */
/**************************************************************************/
static void DefaultDmaInitStruct()
{
    /* Configure DMA2D */
    Dma2dHandle.Instance = DMA2D;
    HAL_DMA2D_DeInit(&Dma2dHandle);
    Dma2dHandle.Init.ColorMode = DMA2D_RGB565;

    /* Configures the color mode of the output image */
    DMA2D -> OPFCCR &= ~(uint32_t)DMA2D_OPFCCR_CM;
    DMA2D -> OPFCCR |= DMA2D_RGB565;
}

/**************************************************************************/
/*  gx_dma_init                                                           */
/*    Program DMA2D control structure values                              */
/**************************************************************************/
static void gx_dma_init(uint32_t Mode, uint32_t OutputMemoryAdd, uint32_t OutputOffset, uint32_t PixelPerLine, uint32_t NumberOfLine)
{
uint32_t pixline  = 0;

    /* Configures the DMA2D operation mode */
    DMA2D -> CR &= (uint32_t)CR_MASK;
    DMA2D -> CR |= Mode;

    /* Configures the output memory address */
    DMA2D -> OMAR = OutputMemoryAdd;

    /* Configure  the line Offset */
    DMA2D -> OOR &= ~(uint32_t)DMA2D_OOR_LO;
    DMA2D -> OOR |= (OutputOffset);

    /* Configure the number of line and pixel per line */
    pixline = PixelPerLine << 16;
    DMA2D -> NLR &= ~(DMA2D_NLR_NL | DMA2D_NLR_PL);
    DMA2D -> NLR |= ((NumberOfLine) | (pixline));
}

/**************************************************************************/
/*  gx_dma_run                                                            */
/*    Kick off a DMA2D operation                                          */
/*    Possibly call back into application while waiting for operation to  */
/*    complete.                                                           */
/**************************************************************************/
static void gx_dma_run()
{
    if (dma_wait_function == GX_NULL)
    {
        TIMING_CPU_WORK_END     // cpu work is done
    }

    /* tell the engine to start */
    DMA2D -> CR |= (uint32_t)DMA2D_CR_START;

    if (dma_wait_function)
    {
        dma_wait_function(wait_func_param);
        dma_wait_function = GX_NULL;
        TIMING_CPU_WORK_END     // cpu work is done
    }

    /* Wait for TCIF Flag activation */

    while (((DMA2D -> ISR) & 0x02) == 0)
    {
    }

    /* clear the status flag */

    DMA2D -> IFCR |= 0x02;
    TIMING_CPU_WORK_BEGIN // back to doing cpu work
}

/**************************************************************************/
/*  gx_chromeart_horizontal_line_draw                                     */
/*    Override generic function to utilize DMA2D                          */
/**************************************************************************/
static VOID gx_chromeart_rotated_horizontal_line_draw(GX_DRAW_CONTEXT *context, INT xstart, INT xend, INT ypos, INT width, GX_COLOR color)
{
uint32_t   put;
int        length;
GX_CANVAS *canvas = context -> gx_draw_context_canvas;

    length = xend - xstart + 1;

    if (canvas -> gx_canvas_display -> gx_display_rotation_angle == GX_SCREEN_ROTATION_CW)
    {
        xstart = ypos;
        ypos = (canvas -> gx_canvas_x_resolution - xend - 1);
    }
    else
    {
        GX_SWAP_VALS(xstart, ypos);
        xstart = (canvas -> gx_canvas_y_resolution - xstart - width);
    }

