eclipse-threadx/guix/src/display_driver/stm324x9i_eval/gx_display_driver_stm324x9i_565rgb_rotated.c
    put = (uint32_t)canvas -> gx_canvas_memory;
    put += (canvas -> gx_canvas_y_resolution * 2 * ypos) + (xstart * 2);


    gx_dma_init(DMA2D_R2M, put, canvas -> gx_canvas_y_resolution - width, width, length);
    DMA2D -> OCOLR = color;

    gx_dma_run();
}


/**************************************************************************/
/*  gx_chromeart_vertial_line_draw                                        */
/*    Override generic function to utilize DMA2D                          */
/**************************************************************************/
static VOID gx_chromeart_rotated_vertical_line_draw(GX_DRAW_CONTEXT *context, INT ystart, INT yend, INT xpos, INT width, GX_COLOR color)
{
uint32_t   put;
GX_CANVAS *canvas = context -> gx_draw_context_canvas;
int        length;

    length = yend - ystart + 1;

    if (canvas -> gx_canvas_display -> gx_display_rotation_angle == GX_SCREEN_ROTATION_CW)
    {
        GX_SWAP_VALS(xpos, ystart)
        ystart = canvas -> gx_canvas_x_resolution - ystart - width;
    }
    else
    {
        ystart = xpos;
        xpos = canvas -> gx_canvas_y_resolution - yend - 1;
    }

    put = (uint32_t)canvas -> gx_canvas_memory;
    put += (canvas -> gx_canvas_y_resolution * 2 * ystart) + (xpos * 2);

    gx_dma_init(DMA2D_R2M, put, canvas -> gx_canvas_y_resolution - length, length, width);
    DMA2D -> OCOLR = color;
    gx_dma_run();
}

/**************************************************************************/
/*  gx_chromeart_canvas_copy                                              */
/*    Override generic function to utilize DMA2D                          */
/**************************************************************************/
static void gx_chromeart_rotated_canvas_copy(GX_CANVAS *canvas, GX_CANVAS *composite)
{
GX_RECTANGLE dirty;
GX_RECTANGLE overlap;
USHORT      *read;
USHORT      *write;
INT          width;
GX_RECTANGLE rotated_overlap;
INT          rotated_dirty_left;
INT          rotated_dirty_top;

    dirty.gx_rectangle_left = dirty.gx_rectangle_top = 0;
    dirty.gx_rectangle_right = canvas -> gx_canvas_x_resolution - 1;
    dirty.gx_rectangle_bottom = canvas -> gx_canvas_y_resolution - 1;

    _gx_utility_rectangle_shift(&dirty, canvas -> gx_canvas_display_offset_x, canvas -> gx_canvas_display_offset_y);

    if (_gx_utility_rectangle_overlap_detect(&dirty, &composite -> gx_canvas_dirty_area, &overlap))
    {
        if (canvas -> gx_canvas_display -> gx_display_rotation_angle == GX_SCREEN_ROTATION_CW)
        {
            rotated_overlap.gx_rectangle_left = overlap.gx_rectangle_top;
            rotated_overlap.gx_rectangle_right = overlap.gx_rectangle_bottom;
            rotated_overlap.gx_rectangle_top = canvas -> gx_canvas_x_resolution - overlap.gx_rectangle_right - 1;
            rotated_overlap.gx_rectangle_bottom = canvas -> gx_canvas_x_resolution - overlap.gx_rectangle_left - 1;

            rotated_dirty_left = dirty.gx_rectangle_top;
            rotated_dirty_top = canvas -> gx_canvas_x_resolution - dirty.gx_rectangle_right - 1;
        }
        else
        {
            rotated_overlap.gx_rectangle_left = canvas -> gx_canvas_y_resolution - overlap.gx_rectangle_bottom - 1;
            rotated_overlap.gx_rectangle_right = canvas -> gx_canvas_y_resolution - overlap.gx_rectangle_top - 1;
            rotated_overlap.gx_rectangle_top = overlap.gx_rectangle_left;
            rotated_overlap.gx_rectangle_bottom = overlap.gx_rectangle_right;

            rotated_dirty_left = canvas -> gx_canvas_y_resolution - dirty.gx_rectangle_bottom - 1;
            rotated_dirty_top = dirty.gx_rectangle_left;
        }

        width = rotated_overlap.gx_rectangle_right - rotated_overlap.gx_rectangle_left + 1;
        read = (USHORT *)canvas -> gx_canvas_memory;

        /* index into starting row */
        read += (rotated_overlap.gx_rectangle_top - rotated_dirty_top) * canvas -> gx_canvas_y_resolution;

        /* index into pixel */

        read += rotated_overlap.gx_rectangle_left - rotated_dirty_left;

        /* calculate the write pointer */
        write = (USHORT *)composite -> gx_canvas_memory;
        write += rotated_overlap.gx_rectangle_top * composite -> gx_canvas_y_resolution;
        write += rotated_overlap.gx_rectangle_left;

        gx_dma_init(DMA2D_M2M, (uint32_t)write, STM32F429_DISCO_SCREEN_WIDTH - width, width, rotated_overlap.gx_rectangle_bottom - rotated_overlap.gx_rectangle_top + 1);

        DMA2D -> FGPFCCR = (0xff000000) | DMA2D_RGB565;           // foreground format conversion
        DMA2D -> FGMAR = (uint32_t)read;                          // foreground memory address
        DMA2D -> FGOR = canvas -> gx_canvas_y_resolution - width; // foreground offset
        gx_dma_run();
    }
}


/**************************************************************************/
/*  gx_chromeart_rotated_pixelmap_blend                                   */
/*    Override generic function to utilize DMA2D                          */
/**************************************************************************/
static void gx_chromeart_rotated_pixelmap_blend(GX_DRAW_CONTEXT *context,
                                                INT xpos, INT ypos, GX_PIXELMAP *pixelmap, UCHAR alpha)
{
INT           width;
INT           height;
USHORT       *putrow;
USHORT       *getshort;
GX_CANVAS    *canvas;
ULONG         blend_reg;
GX_RECTANGLE *clip;
GX_RECTANGLE  rotated_clip;

    /* if the pixelmap is compressed, we must draw
       in software
     */
    if ((pixelmap -> gx_pixelmap_flags & GX_PIXELMAP_COMPRESSED) ||
        (pixelmap -> gx_pixelmap_format == GX_COLOR_FORMAT_565RGB) ||
        ((pixelmap -> gx_pixelmap_flags & GX_PIXELMAP_ALPHA) && (pixelmap -> gx_pixelmap_format == GX_COLOR_FORMAT_565RGB)))
    {
        _gx_display_driver_565rgb_rotated_pixelmap_blend(context, xpos, ypos, pixelmap, alpha);
        return;
    }

    /* the pixelmap is raw, use ChromeArt */
    clip = context -> gx_draw_context_clip;
    canvas = context -> gx_draw_context_canvas;

