eclipse-threadx/guix/src/display_driver/stm324x9i_eval/gx_display_driver_stm324x9i_565rgb_rotated.c
    GX_SWAP_VALS(xpos, ypos)
    if (canvas -> gx_canvas_display -> gx_display_rotation_angle == GX_SCREEN_ROTATION_CW)
    {
        rotated_clip.gx_rectangle_left = clip -> gx_rectangle_top;
        rotated_clip.gx_rectangle_right = clip -> gx_rectangle_bottom;
        rotated_clip.gx_rectangle_top = canvas -> gx_canvas_x_resolution - clip -> gx_rectangle_right - 1;
        rotated_clip.gx_rectangle_bottom = canvas -> gx_canvas_x_resolution - clip -> gx_rectangle_left - 1;

        ypos = canvas -> gx_canvas_x_resolution - ypos - pixelmap -> gx_pixelmap_width;
    }
    else
    {
        rotated_clip.gx_rectangle_left = canvas -> gx_canvas_y_resolution - clip -> gx_rectangle_top - 1;
        rotated_clip.gx_rectangle_right = canvas -> gx_canvas_y_resolution - clip -> gx_rectangle_bottom - 1;
        rotated_clip.gx_rectangle_top = clip -> gx_rectangle_left;
        rotated_clip.gx_rectangle_bottom = clip -> gx_rectangle_right;

        xpos = canvas -> gx_canvas_y_resolution - xpos - pixelmap -> gx_pixelmap_height;
    }

    putrow = (USHORT *)context -> gx_draw_context_memory;
    putrow += rotated_clip.gx_rectangle_top * context -> gx_draw_context_pitch;
    putrow += rotated_clip.gx_rectangle_left;

    getshort = (USHORT *)(pixelmap -> gx_pixelmap_data);
    getshort += pixelmap -> gx_pixelmap_height * (rotated_clip.gx_rectangle_top - ypos);
    getshort += (rotated_clip.gx_rectangle_left - xpos);

    width = rotated_clip.gx_rectangle_right - rotated_clip.gx_rectangle_left + 1;
    height = rotated_clip.gx_rectangle_bottom - rotated_clip.gx_rectangle_top + 1;

    gx_dma_init(DMA2D_M2M_BLEND, (uint32_t)putrow, canvas -> gx_canvas_y_resolution - width, width, height);

    /* Set foreground memory address.  */
    DMA2D -> FGMAR = (uint32_t)getshort;

    blend_reg = (alpha << 24);
    blend_reg |= DMA2D_RGB565;

    if (pixelmap -> gx_pixelmap_flags & GX_PIXELMAP_ALPHA)
    {
        /* Blend original alpha with alpha.  */
        blend_reg |= (DMA2D_COMBINE_ALPHA << 16);
    }
    else
    {
        /* Replace alpha.  */
        blend_reg |= (DMA2D_REPLACE_ALPHA << 16);
    }

    /* Set foreground format conversion.  */
    DMA2D -> FGPFCCR = blend_reg;

    /* Set foreground offset.  */
    DMA2D -> FGOR = pixelmap -> gx_pixelmap_height - width;

    /* Set background memory address. */
    DMA2D -> BGMAR = (uint32_t)putrow;

    /* Set background offset.  */
    DMA2D -> BGOR = canvas -> gx_canvas_y_resolution - width;
    DMA2D -> BGPFCCR = 0xff000000 | (DMA2D_REPLACE_ALPHA << 16) | CM_RGB565;

    gx_dma_run();
}

/**************************************************************************/
/*  gx_chromeart_rotated_pixelmap_draw                                    */
/*    Override generic function to utilize DMA2D                          */
/**************************************************************************/
static void gx_chromeart_rotated_pixelmap_draw(GX_DRAW_CONTEXT *context,
                                               INT xpos, INT ypos, GX_PIXELMAP *pixelmap)
{
INT           width;
INT           height;
USHORT       *putrow;
GX_UBYTE     *get;
GX_CANVAS    *canvas;
ULONG         reg_val;
uint32_t      DMA2D_Mode;
GX_RECTANGLE *clip;
GX_RECTANGLE  rotated_clip;
INT           map_offset;


    /* If the pixelmap is compressed, we must draw in software.  */
    if (pixelmap -> gx_pixelmap_flags & (GX_PIXELMAP_COMPRESSED | GX_PIXELMAP_TRANSPARENT))
    {
        _gx_display_driver_565rgb_rotated_pixelmap_draw(context, xpos, ypos, pixelmap);
        return;
    }

    /* If the pixelmap is 565 format with alpha channel, we must draw in software.  */
    if (pixelmap -> gx_pixelmap_flags & GX_PIXELMAP_ALPHA &&
        pixelmap -> gx_pixelmap_format == GX_COLOR_FORMAT_565RGB)
    {
        _gx_display_driver_565rgb_rotated_pixelmap_draw(context, xpos, ypos, pixelmap);
        return;
    }
    
    if(context -> gx_draw_context_brush.gx_brush_alpha != 0xff)
    {
        gx_chromeart_rotated_pixelmap_blend(context, xpos, ypos, pixelmap, context -> gx_draw_context_brush.gx_brush_alpha);
        return;
    }

    /* The pixelmap is raw, use ChromeArt.  */
    clip = context -> gx_draw_context_clip;
    canvas = context -> gx_draw_context_canvas;

    GX_SWAP_VALS(xpos, ypos)
    if (canvas -> gx_canvas_display -> gx_display_rotation_angle == GX_SCREEN_ROTATION_CW)
    {
        rotated_clip.gx_rectangle_left = clip -> gx_rectangle_top;
        rotated_clip.gx_rectangle_right = clip -> gx_rectangle_bottom;
        rotated_clip.gx_rectangle_top = canvas -> gx_canvas_x_resolution - clip -> gx_rectangle_right - 1;
        rotated_clip.gx_rectangle_bottom = canvas -> gx_canvas_x_resolution - clip -> gx_rectangle_left - 1;

        ypos = canvas -> gx_canvas_x_resolution - ypos - pixelmap -> gx_pixelmap_width;
    }
    else
    {
        rotated_clip.gx_rectangle_left = canvas -> gx_canvas_y_resolution - clip -> gx_rectangle_bottom - 1;
        rotated_clip.gx_rectangle_right = canvas -> gx_canvas_y_resolution - clip -> gx_rectangle_top - 1;
        rotated_clip.gx_rectangle_top = clip -> gx_rectangle_left;
        rotated_clip.gx_rectangle_bottom = clip -> gx_rectangle_right;

        xpos = canvas -> gx_canvas_y_resolution - xpos - pixelmap -> gx_pixelmap_height;
    }

    width = rotated_clip.gx_rectangle_right - rotated_clip.gx_rectangle_left + 1;
    height = rotated_clip.gx_rectangle_bottom - rotated_clip.gx_rectangle_top + 1;

    putrow = (USHORT *)context -> gx_draw_context_memory;
    putrow += rotated_clip.gx_rectangle_top * context -> gx_draw_context_pitch;
    putrow += rotated_clip.gx_rectangle_left;

    map_offset = pixelmap -> gx_pixelmap_height * (rotated_clip.gx_rectangle_top - ypos);
    map_offset += (rotated_clip.gx_rectangle_left - xpos);

    reg_val = 0xff000000;
    if (pixelmap -> gx_pixelmap_flags & GX_PIXELMAP_ALPHA)
    {
        DMA2D_Mode = DMA2D_M2M_BLEND;

        /* Set background memory address.  */
        DMA2D -> BGMAR = (uint32_t)putrow;

