eclipse-threadx/guix/src/display_driver/stm324x9i_eval/gx_display_driver_stm324x9i_565rgb_rotated.c
        /* Set background offset.  */
        DMA2D -> BGOR = canvas -> gx_canvas_y_resolution - width;

        /* Set background alpha mode and color mode. */
        DMA2D -> BGPFCCR = 0xff000000 | (DMA2D_REPLACE_ALPHA << 16) | CM_RGB565;
    }
    else
    {
        reg_val |= (DMA2D_REPLACE_ALPHA << 16);
        DMA2D_Mode = DMA2D_M2M;
    }

    switch (pixelmap -> gx_pixelmap_format)
    {
    case GX_COLOR_FORMAT_565RGB:
        map_offset <<= 1;
        reg_val |= CM_RGB565;
        break;

    case GX_COLOR_FORMAT_4444ARGB:
        map_offset <<= 1;
        reg_val |= CM_ARGB4444;
        break;

    case GX_COLOR_FORMAT_8BIT_PALETTE:
        reg_val |= CM_L8;

        /* Set CLUT address.  */
        DMA2D -> FGCMAR = (uint32_t)pixelmap -> gx_pixelmap_aux_data;

        /* Set CLUT size.  */
        DMA2D -> FGPFCCR |= (pixelmap -> gx_pixelmap_aux_data_size << 8);

        /* Start the automatic loading of CLUT.  */
        DMA2D -> FGPFCCR |= (0x1 << 5);

        /* Wait CLUT loading complete.  */
        while (((DMA2D -> ISR) & DMA2D_ISR_CTCIF) == 0)
        {
        }

        DMA2D_Mode = DMA2D_M2M_PFC;
        break;

    default:
        return;
    }

    get = (GX_UBYTE *)(pixelmap -> gx_pixelmap_data);
    get += map_offset;

    /* Set forground memory address.  */
    DMA2D -> FGMAR = (uint32_t)(get);
    DMA2D -> FGPFCCR = reg_val;

    /* Set forground offset. */
    DMA2D -> FGOR = pixelmap -> gx_pixelmap_height - width;

    gx_dma_init(DMA2D_Mode, (uint32_t)putrow, canvas -> gx_canvas_y_resolution - width, width, height);
    gx_dma_run();
}

/**************************************************************************/
/*  gx_chromeart_glyph_8bit_draw                                          */
/*    Override generic function to utilize DMA2D                          */
/**************************************************************************/
static void gx_chromeart_rotated_glyph_8bit_draw(GX_DRAW_CONTEXT *context, GX_RECTANGLE *draw_area,
                                                 GX_POINT *map_offset, const GX_GLYPH *glyph)
{
GX_CANVAS *canvas;
GX_UBYTE  *read_glyph;
USHORT    *write_row;
GX_COLOR   text_color;
UINT       height;
UINT       width;
UCHAR      red, green, blue;
GX_UBYTE   alpha;
ULONG      pfc_reg;
GX_VALUE   rotated_map_offset_x;
GX_VALUE   rotated_map_offset_y;
GX_VALUE   rotated_left;
GX_VALUE   rotated_top;

    text_color =  context -> gx_draw_context_brush.gx_brush_line_color;

    alpha = context -> gx_draw_context_brush.gx_brush_alpha;

    if (alpha == 0)
    {
        return;
    }

    red = (text_color & 0xf800) >> 8;
    green = (text_color & 0x07e0) >> 3;
    blue = (text_color & 0x001f) << 3;
    text_color = (red << 16) | (green << 8) | blue;

    /* pickup pointer to current display driver */
    canvas = context -> gx_draw_context_canvas;

    if (context -> gx_draw_context_display -> gx_display_rotation_angle == GX_SCREEN_ROTATION_CW)
    {
        rotated_left = draw_area -> gx_rectangle_top;
        rotated_top = (GX_VALUE)(canvas -> gx_canvas_x_resolution - draw_area -> gx_rectangle_right - 1);

        rotated_map_offset_x = map_offset -> gx_point_y;
        rotated_map_offset_y = (GX_VALUE)(glyph -> gx_glyph_width - map_offset -> gx_point_x - (GX_VALUE)(draw_area -> gx_rectangle_right - draw_area -> gx_rectangle_left + 1));
    }
    else
    {
        rotated_left = (GX_VALUE)(canvas -> gx_canvas_display_offset_y - draw_area -> gx_rectangle_bottom - 1);
        rotated_top = draw_area -> gx_rectangle_left;

        rotated_map_offset_x = (GX_VALUE)(glyph -> gx_glyph_height - map_offset -> gx_point_y - (GX_VALUE)(draw_area -> gx_rectangle_bottom - draw_area -> gx_rectangle_top + 1));
        rotated_map_offset_y = map_offset -> gx_point_x;
    }

    read_glyph = (GX_UBYTE *)glyph -> gx_glyph_map;

    if (rotated_map_offset_y)
    {
        read_glyph = read_glyph + (glyph -> gx_glyph_height * rotated_map_offset_y);
    }

    read_glyph += rotated_map_offset_x;

    height = draw_area -> gx_rectangle_right - draw_area -> gx_rectangle_left + 1;
    width = draw_area -> gx_rectangle_bottom - draw_area -> gx_rectangle_top + 1;

    write_row = (USHORT *)canvas -> gx_canvas_memory;
    write_row += rotated_top * context -> gx_draw_context_pitch;
    write_row += rotated_left;

    gx_dma_init(DMA2D_M2M_BLEND, (uint32_t)write_row, canvas -> gx_canvas_y_resolution - width, width, height);

    DMA2D -> FGMAR = (uint32_t)read_glyph;            // foreground memory address
    DMA2D -> FGOR = glyph -> gx_glyph_height - width; // foreground offset
    pfc_reg = alpha;
    pfc_reg <<= 24;
    pfc_reg |= 0x00020009;

    DMA2D -> FGPFCCR = pfc_reg;
    DMA2D -> FGCOLR = text_color;

    DMA2D -> BGMAR = (uint32_t)write_row;                     // background memory address
    DMA2D -> BGOR = canvas -> gx_canvas_y_resolution - width; // background offset
    DMA2D -> BGPFCCR = 0xff000002;

    gx_dma_run();
}

#if defined(GX_TIMING_ENABLE)
/**************************************************************************/
/*  gx_chromeart_drawing_initiate                                         */
/*    Override generic function to toggle I/O to allow precise timing     */
/*    measurement.                                                        */
/**************************************************************************/
static VOID gx_chromeart_drawing_initiate(GX_DISPLAY *display, GX_CANVAS *canvas)
{
TIMING_FRAME_CALC_BEGIN
    TIMING_CPU_WORK_BEGIN
}

/**************************************************************************/
/*  gx_chromeart_drawing_complete                                         */
/*    Override generic function to toggle I/O to allow precise timing     */
/*    measurement.                                                        */
/**************************************************************************/
static VOID gx_chromeart_drawing_complete(GX_DISPLAY *display, GX_CANVAS *canvas)
{
TIMING_FRAME_CALC_END
    TIMING_CPU_WORK_END
}
#endif

/**************************************************************************/
/*  stm32f429_24xrgb_buffer_toggle                                        */
/*    Override generic function to utilize DMA2D                          */
/**************************************************************************/
static void stm32f429_565rgb_buffer_rotated_toggle(GX_CANVAS *canvas, GX_RECTANGLE *dirty)
{
GX_RECTANGLE Limit;
GX_RECTANGLE Copy;
GX_RECTANGLE rotated_copy;
INT          rotated_offset_x;
INT          rotated_offset_y;
ULONG        offset;
INT          copy_width;
INT          copy_height;

#if !defined(GX_CHROMEART_ENABLE)
INT row;
INT src_stride_ulongs;
INT dest_stride_ulongs;
#endif

ULONG  *get;
ULONG  *put;
#ifdef GX_PING_PONG_FRAME_BUFFERS
USHORT *temp;

    frame_buffer_toggle_start = GX_TRUE;

    /* Set frame buffer start address. */
    LTDC_Layer1 -> CFBAR = (uint32_t)canvas -> gx_canvas_memory;
    LTDC -> SRCR = LTDC_SRCR_VBR;

    /* Wait for register reload interrupt. */
    tx_semaphore_get(&register_reload_semaphore, TX_WAIT_FOREVER);
#endif

    gx_utility_rectangle_define(&Limit, 0, 0,
                                canvas -> gx_canvas_x_resolution - 1,
                                canvas -> gx_canvas_y_resolution - 1);

    if (gx_utility_rectangle_overlap_detect(&Limit, &canvas -> gx_canvas_dirty_area, &Copy))
    {
        if (canvas -> gx_canvas_display -> gx_display_rotation_angle == GX_SCREEN_ROTATION_CW)
        {
            rotated_copy.gx_rectangle_left = Copy.gx_rectangle_top;
            rotated_copy.gx_rectangle_right = Copy.gx_rectangle_bottom;
            rotated_copy.gx_rectangle_top = canvas -> gx_canvas_x_resolution - Copy.gx_rectangle_right - 1;
            rotated_copy.gx_rectangle_bottom = canvas -> gx_canvas_x_resolution - Copy.gx_rectangle_left - 1;

            rotated_offset_x = canvas -> gx_canvas_display_offset_y;
            rotated_offset_y = STM32F429_DISCO_SCREEN_HEIGHT - canvas -> gx_canvas_display_offset_x - canvas -> gx_canvas_x_resolution;
        }
        else
        {
            rotated_copy.gx_rectangle_left = canvas -> gx_canvas_y_resolution - Copy.gx_rectangle_bottom - 1;
            rotated_copy.gx_rectangle_right = canvas -> gx_canvas_y_resolution - Copy.gx_rectangle_top - 1;
            rotated_copy.gx_rectangle_top = Copy.gx_rectangle_left;
            rotated_copy.gx_rectangle_bottom = Copy.gx_rectangle_right;

