eclipse-threadx/guix/src/display_driver/stm324x9i_eval/gx_display_driver_stm324x9i_565rgb_rotated.c
            rotated_offset_x = STM32F429_DISCO_SCREEN_WIDTH - canvas -> gx_canvas_display_offset_y - canvas -> gx_canvas_y_resolution;
            rotated_offset_y = canvas -> gx_canvas_display_offset_x;
        }

        rotated_copy.gx_rectangle_left &= 0xfffe;
        rotated_copy.gx_rectangle_right |= 0x01;
        copy_width = rotated_copy.gx_rectangle_right - rotated_copy.gx_rectangle_left + 1;

        copy_height = rotated_copy.gx_rectangle_bottom - rotated_copy.gx_rectangle_top + 1;

        offset = rotated_copy.gx_rectangle_top * canvas -> gx_canvas_y_resolution;
        offset += rotated_copy.gx_rectangle_left;
        offset /= 2;        // in ulongs
        get = canvas -> gx_canvas_memory;
        get += offset;

        // offset by dirty rect pos
        put = (ULONG *)visible_frame_buffer;

        // offset by canvas offset:
        offset = (rotated_offset_y + rotated_copy.gx_rectangle_top) * STM32F429_DISCO_SCREEN_WIDTH;
        offset += rotated_offset_x + rotated_copy.gx_rectangle_left;
        offset /= 2;
        put += offset;


#if defined(GX_CHROMEART_ENABLE)
        gx_dma_init(DMA2D_M2M, (uint32_t)put, STM32F429_DISCO_SCREEN_WIDTH - copy_width, copy_width, copy_height);

        DMA2D -> FGPFCCR = (0xff000000) | DMA2D_RGB565;                // foreground format conversion
        DMA2D -> FGMAR = (uint32_t)get;                                // foreground memory address
        DMA2D -> FGOR = canvas -> gx_canvas_y_resolution - copy_width; // foreground offset
        gx_dma_run();

#else
        src_stride_ulongs = canvas -> gx_canvas_y_resolution / 2;
        dest_stride_ulongs = STM32F429_DISCO_SCREEN_WIDTH / 2;
        copy_width /= 2;     // in ulongs

        for (row = 0; row < copy_height; row++)
        {
            memcpy(put, get, copy_width * 4); /* Use case of memcpy is verified. */
            put += dest_stride_ulongs;
            get += src_stride_ulongs;
        }
#endif

#ifdef GX_PING_PONG_FRAME_BUFFERS
        /* Toggle frame buffer. */
        temp = (USHORT *)canvas -> gx_canvas_memory;
        canvas -> gx_canvas_memory = (ULONG *)visible_frame_buffer;
        visible_frame_buffer = temp;
#endif
    }
    TIMING_CPU_WORK_END
}

/*****************************************************************************/
/* Functions for configuring and using Graphics Layer 2                      */
/*****************************************************************************/
static LTDC_HandleTypeDef hltdc_anim;
static GX_LAYER_PARAMS    layer2_params;

/**************************************************************************/
/*  GraphicsLayerInitialize                                               */
/*    Configure graphics layer2, the overlay layer                        */
/**************************************************************************/
static UINT GraphicsLayerInitialize(INT layer, GX_CANVAS *canvas)
{
int       loop;
GX_COLOR *color;
ULONG     regval;

    if (layer != 2)
    {
        // graphics layer 1 is configured during initial setup, nothing
        // to do here.
        return GX_FAILURE;
}

hltdc_anim    .Instance = LTDC;
LCD_LayerCfgTypeDef Layercfg;

    Layercfg.WindowX0 = 0;
    Layercfg.WindowX1 = canvas -> gx_canvas_y_resolution;
    Layercfg.WindowY0 = 0;
    Layercfg.WindowY1 = canvas -> gx_canvas_x_resolution;

    Layercfg.PixelFormat = LTDC_PIXEL_FORMAT_RGB565;
    Layercfg.FBStartAdress = (uint32_t)canvas -> gx_canvas_memory;
    Layercfg.Alpha = 255;
    Layercfg.Alpha0 = 0;
    Layercfg.Backcolor.Blue = 0;
    Layercfg.Backcolor.Green = 0;
    Layercfg.Backcolor.Red = 0;
    Layercfg.BlendingFactor1 = LTDC_BLENDING_FACTOR2_PAxCA;
    Layercfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
    Layercfg.ImageWidth = canvas -> gx_canvas_x_resolution;
    Layercfg.ImageHeight = canvas -> gx_canvas_y_resolution;
    //Layercfg.ImageWidth = STM32F429_DISCO_SCREEN_WIDTH;
    //Layercfg.ImageHeight = STM32F429_DISCO_SCREEN_HEIGHT;

    HAL_LTDC_ConfigLayer(&hltdc_anim, &Layercfg, layer - 1);

    // set the initial alpha to 0 and disable graphics layer2
    LTDC_Layer2 -> CACR = 0;
    LTDC_Layer2 -> CR = 0x00;
    LTDC -> SRCR = LTDC_SRCR_IMR;

    color = canvas -> gx_canvas_memory;

    for (loop = 0; loop < (canvas -> gx_canvas_x_resolution * canvas -> gx_canvas_y_resolution) / 2; loop++)
    {
        *color++ = 0x00;
    }

    layer2_params.canvas_width = canvas -> gx_canvas_y_resolution;
    layer2_params.canvas_height = canvas -> gx_canvas_x_resolution;

    // save off the vertical and horizontal timing params, so that
    // we can offset from here if the app request a canvas shift

    regval = LTDC_Layer2 -> WHPCR;
    layer2_params.horizontal_start = regval & 0xffff;
    regval = LTDC_Layer2 -> WVPCR;
    layer2_params.vertical_start = regval & 0xffff;


    layer2_params.canvas_memory = (USHORT *)canvas -> gx_canvas_memory;
    return GX_SUCCESS;
}

/**************************************************************************/
/*  GraphicsLayerShow                                                     */
/*    Show the specified graphics layer                                   */
/**************************************************************************/
static VOID GraphicsLayerShow(INT Layer)
{
LTDC_Layer_TypeDef *layer_regs;

    if (Layer == 1)
    {
        layer_regs = LTDC_Layer1;
    }
    else
    {
        layer_regs = LTDC_Layer2;
    }
    layer_regs -> CR = 0x01;
    LTDC -> SRCR = LTDC_SRCR_VBR;
}

/**************************************************************************/
/*  GraphicsLayerHide                                                     */
/*    HIde the specified graphics layer                                   */
/**************************************************************************/
static void GraphicsLayerHide(INT Layer)
{
LTDC_Layer_TypeDef *layer_regs;

    if (Layer == 1)
    {
        layer_regs = LTDC_Layer1;
    }
    else
    {
        layer_regs = LTDC_Layer2;
    }

