eclipse-threadx/guix/src/display_driver/stm324x9i_eval/gx_display_driver_stm324x9i_565rgb_rotated.c
    layer_regs -> CR = 0x00;
    layer_regs -> CACR = 0;
    LTDC -> SRCR = LTDC_SRCR_VBR;
}

/**************************************************************************/
/*  GraphicsLayerAlphaSet                                                 */
/*    Assign graphics layer alpha value                                   */
/**************************************************************************/
static void GraphicsLayerAlphaSet(INT Layer, UCHAR alpha)
{
LTDC_Layer_TypeDef *layer_regs;

    if (Layer == 1)
    {
        layer_regs = LTDC_Layer1;
    }
    else
    {
        layer_regs = LTDC_Layer2;
    }

    layer_regs -> CACR = alpha;
    LTDC -> SRCR = LTDC_SRCR_VBR;
}

/**************************************************************************/
/*  GraphicsLayerPosSet                                                   */
/*    Assign graphics layer offset within display                         */
/**************************************************************************/
static void GraphicsLayerPosSet(INT layer, GX_VALUE xpos, GX_VALUE ypos)
{
uint32_t regval;
uint32_t frame_address;
INT      offset;
INT      width;
int      height;

    if (layer != 2)
    {
        return;
    }

    if (xpos >= 0)
    {
        width = layer2_params.canvas_width;

        if ((width + xpos) >= STM32F429_DISCO_SCREEN_WIDTH)
        {
            width = STM32F429_DISCO_SCREEN_WIDTH - xpos;
        }
        frame_address = (uint32_t)layer2_params.canvas_memory;
        LTDC_Layer2 -> CFBAR = frame_address;

        offset = xpos + layer2_params.horizontal_start;
        regval = ((offset + width - 1) << 16) | offset;
        LTDC_Layer2 -> WHPCR = regval;
        regval = (layer2_params.canvas_width * 2) << 16;    // horizontal pitch
        regval |= (width * 2) + 3;                          // horizontal line length
        LTDC_Layer2 -> CFBLR = regval;
    }
    else
    {
        offset = -xpos;
        frame_address = (uint32_t)layer2_params.canvas_memory;
        frame_address += offset * 2;
        LTDC_Layer2 -> CFBAR = frame_address;

        width = layer2_params.canvas_width - offset;
        regval = ((layer2_params.horizontal_start + width - 1) << 16) | (layer2_params.horizontal_start);
        LTDC_Layer2 -> WHPCR = regval;
        regval = (layer2_params.canvas_width * 2) << 16;    // horizontal pitch
        regval |= (width * 2) + 3;                          // horizontal line length
        LTDC_Layer2 -> CFBLR = regval;
    }

    // here for shift in Y direction
    if (ypos >= 0)
    {
        height = layer2_params.canvas_height;
        if ((ypos + height) > STM32F429_DISCO_SCREEN_HEIGHT)
        {
            height = STM32F429_DISCO_SCREEN_HEIGHT - ypos;
        }

        LTDC_Layer2 -> CFBLNR = height;

        offset = layer2_params.vertical_start + ypos;
        regval = ((offset + height - 1) << 16) | offset;
        LTDC_Layer2 -> WVPCR = regval;
    }
    else
    {
        regval = frame_address;
        offset = -ypos;
        regval += offset * layer2_params.canvas_width * 2;
        LTDC_Layer2 -> CFBAR = regval;

        height = layer2_params.canvas_height - offset;
        regval = ((layer2_params.vertical_start + height - 1) << 16) | (layer2_params.vertical_start);
        LTDC_Layer2 -> WVPCR = regval;
        LTDC_Layer2 -> CFBLNR = height;
    }
    LTDC -> SRCR = LTDC_SRCR_VBR;
}


/**************************************************************************/
/* define layer services supporting graphics overlay layer                */
/**************************************************************************/
static GX_DISPLAY_LAYER_SERVICES stm32_graphics_layer_services = {
    GraphicsLayerInitialize,
    GraphicsLayerShow,
    GraphicsLayerHide,
    GraphicsLayerAlphaSet,
    GraphicsLayerPosSet
};

/**************************************************************************/
/*  LTDC_IRQHandler                                                       */
/*    Handle line interrupt and register reload interrupt                 */
/**************************************************************************/
#if defined(GX_DISABLE_THREADX_TIMER_SOURCE) || defined(GX_PING_PONG_FRAME_BUFFERS)
void LTDC_IRQHandler()
{
#ifdef GX_DISABLE_THREADX_TIMER_SOURCE
    if (LTDC -> ISR & LTDC_ISR_LIF)
    {
        /* Clear the line interrupt flag. */
        LTDC -> ICR |= LTDC_ICR_CLIF;

        /* If there are no active timers just stop the timer from running. */
        if (_gx_system_active_timer_list == GX_NULL &&
            _gx_system_animation_list == GX_NULL)
        {
            return;
    }

    GX_EVENT timer_event;

        timer_event.gx_event_type = GX_EVENT_TIMER;
        timer_event.gx_event_sender = 0;
        timer_event.gx_event_target = GX_NULL;
        timer_event.gx_event_payload.gx_event_ulongdata = 1;
        _gx_system_event_fold(&timer_event);
    }
#endif

#ifdef GX_PING_PONG_FRAME_BUFFERS
    if (LTDC -> ISR & LTDC_ISR_RRIF)
    {
        /* Clear register reload interrupt. */
        LTDC -> ICR |= LTDC_ICR_CRRIF;

        if (frame_buffer_toggle_start)
        {
            frame_buffer_toggle_start = GX_FALSE;
            tx_semaphore_put(&register_reload_semaphore);
        }
    }
#endif
}
#endif

/**************************************************************************/
/* stm32f429_graphics_driver_setup_565rgb                                 */
/*   Configure hardware layer 1 and initialize GX_DISPLAY drawing         */
/*   services.                                                            */
/**************************************************************************/
UINT stm32f429_graphics_driver_setup_565rgb_rotated(GX_DISPLAY *display)
{
	/* initialize the low-level drawing function pointers
	
	   for windows, these are always just the generic funcions,
	   but for some hardware, these will be customized,
	   optimized functions specific to that hardware
	 */
	_gx_display_driver_565rgb_rotated_setup    (display, (VOID *)STM32F429_DISCO_SCREEN_HANDLE, stm32f429_565rgb_buffer_rotated_toggle);

#if defined(GX_TIMING_ENABLE)
	display     -> gx_display_driver_drawing_initiate     = gx_chromeart_drawing_initiate;
	display     -> gx_display_driver_drawing_complete     = gx_chromeart_drawing_complete;
#endif

	// setup support for second graphics layer:
	display     -> gx_display_layer_services = &stm32_graphics_layer_services;

#if defined(GX_CHROMEART_ENABLE)
	/* override those functions that can be accelerated with DMA2D */
	display     -> gx_display_driver_horizontal_line_draw = gx_chromeart_rotated_horizontal_line_draw;
	display     -> gx_display_driver_vertical_line_draw = gx_chromeart_rotated_vertical_line_draw;
	display     -> gx_display_driver_canvas_copy        = gx_chromeart_rotated_canvas_copy;
	display     -> gx_display_driver_pixelmap_draw      = gx_chromeart_rotated_pixelmap_draw;
	display     -> gx_display_driver_pixelmap_blend     = gx_chromeart_rotated_pixelmap_blend;
	display     -> gx_display_driver_8bit_glyph_draw    = gx_chromeart_rotated_glyph_8bit_draw;
	display     -> gx_display_driver_callback_assign    = gx_display_wait_function_set_565rgb;
#endif

	/* Hardware Initialization */
	BSP_LCD_Init    ();
	
	BSP_LCD_LayerDefaultInit    (0, (uint32_t)&frame_buffer);
	BSP_LCD_SelectLayer    (0);
	
	//LCD_SetPixelFormat(DMA2D_RGB565);
	LTDC_Layer1     -> CFBLR = LTDC_Layer1 -> CFBLR / 2;
	LTDC_Layer1     -> PFCR = DMA2D_RGB565;
	LTDC     -> SRCR = LTDC_SRCR_IMR;

#if defined(GX_DISABLE_THREADX_TIMER_SOURCE) || defined(GX_PING_PONG_FRAME_BUFFERS)
#ifdef GX_DISABLE_THREADX_TIMER_SOURCE
	/* Define the position of the line interrupt. */
	LTDC     -> LIPCR = 0;
	
	/* Enable line interrupt. */
	LTDC     -> IER |= LTDC_IER_LIE;
#endif

#ifdef GX_PING_PONG_FRAME_BUFFERS
	/* Enable reload interrupt. */
	LTDC     -> IER |= LTDC_IER_RRIE;
	
	tx_semaphore_create    (&register_reload_semaphore, "register reload semaphore", 0);
#endif

	/* Set USBHS Interrupt priority */
	HAL_NVIC_SetPriority    (LTDC_IRQn, 4, 0);
	
	/* Enable USBHS Interrupt */
	HAL_NVIC_EnableIRQ    (LTDC_IRQn);
#endif

	// clear the frame buffer
	memset    (frame_buffer, 0, STM32F429_DISCO_SCREEN_WIDTH * STM32F429_DISCO_SCREEN_HEIGHT * 2);
	
	// configure default DMA params
	DefaultDmaInitStruct    ();
	
	BSP_LCD_DisplayOn    ();
	
	// drive the timing pins high
	TIMING_FRAME_CALC_END
    TIMING_CPU_WORK_END

    /* Return successful status.  */
    return(GX_SUCCESS);
}

